In [1]:
import pandas as pd

In [3]:
# get the data
!wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-01.csv.gz
!gzip -d green_tripdata_2019-01.csv.gz
!wget https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv

--2023-01-28 12:27:45--  https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-01.csv.gz
Resolving github.com (github.com)... 140.82.121.4
Connecting to github.com (github.com)|140.82.121.4|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/513814948/d3904232-1a2b-431b-803d-0ee802cd14fc?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20230128%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20230128T122650Z&X-Amz-Expires=300&X-Amz-Signature=cfc9cde54fd02663c67945f7b3b6c0268ae43da77027f4dfb07f2af392f2156b&X-Amz-SignedHeaders=host&actor_id=0&key_id=0&repo_id=513814948&response-content-disposition=attachment%3B%20filename%3Dgreen_tripdata_2019-01.csv.gz&response-content-type=application%2Foctet-stream [following]
--2023-01-28 12:27:45--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/513814948/d3904232-1a2b-431b-803d-0ee802cd14fc?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20230128%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20230128T122650Z&X-Amz-Expires=300&X-Amz-Signature=cfc9cde54fd02663c67945f7b3b6c0268ae43da77027f4dfb07f2af392f2156b&X-Amz-SignedHeaders=host&actor_id=0&key_id=0&repo_id=513814948&response-content-disposition=attachment%3B%20filename%3Dgreen_tripdata_2019-01.csv.gz&response-content-type=application%2Foctet-stream
Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.111.133, 185.199.110.133, 185.199.109.133, ...
Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.111.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 11099245 (11M) [application/octet-stream]
Saving to: ‘green_tripdata_2019-01.csv.gz.1’

green_tripdata_2019 100%[===================>]  10,58M  20,6MB/s    in 0,5s

2023-01-28 12:27:46 (20,6 MB/s) - ‘green_tripdata_2019-01.csv.gz.1’ saved [11099245/11099245]

--2023-01-28 12:27:47--  https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.250.166, 52.217.36.222, 54.231.164.144, ...
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.250.166|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 12322 (12K) [application/octet-stream]
Saving to: ‘taxi+_zone_lookup.csv.1’

taxi+_zone_lookup.c 100%[===================>]  12,03K  --.-KB/s    in 0s

2023-01-28 12:27:47 (54,9 MB/s) - ‘taxi+_zone_lookup.csv.1’ saved [12322/12322]

In [2]:
# load 'rides' and 'zones' data
from pathlib import Path

# ensure that pickup and dropoff columns are in 'datetime' format
rides = pd.read_csv(
    Path('green_tripdata_2019-01.csv'), 
    parse_dates=['lpep_pickup_datetime', 'lpep_dropoff_datetime'],
    nrows=100
)
zones = pd.read_csv(Path('taxi+_zone_lookup.csv'))

In [3]:
display(rides.info())
display(zones.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 20 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               100 non-null    int64
 1   lpep_pickup_datetime   100 non-null    datetime64[ns]
 2   lpep_dropoff_datetime  100 non-null    datetime64[ns]
 3   store_and_fwd_flag     100 non-null    object
 4   RatecodeID             100 non-null    int64
 5   PULocationID           100 non-null    int64
 6   DOLocationID           100 non-null    int64
 7   passenger_count        100 non-null    int64
 8   trip_distance          100 non-null    float64
 9   fare_amount            100 non-null    float64
 10  extra                  100 non-null    float64
 11  mta_tax                100 non-null    float64
 12  tip_amount             100 non-null    float64
 13  tolls_amount           100 non-null    float64
 14  ehail_fee              0 non-null      float64
 15  improvement_surcharge  100 non-null    float64
 16  total_amount           100 non-null    float64
 17  payment_type           100 non-null    int64
 18  trip_type              100 non-null    int64
 19  congestion_surcharge   0 non-null      float64
dtypes: datetime64[ns](2), float64(10), int64(7), object(1)
memory usage: 15.8+ KB

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LocationID    265 non-null    int64
 1   Borough       265 non-null    object
 2   Zone          264 non-null    object
 3   service_zone  263 non-null    object
dtypes: int64(1), object(3)
memory usage: 8.4+ KB

None

In [4]:
# create db connection to pgdatabase
from sqlalchemy import create_engine

HOST='localhost'
PORT=5432

USER='root'
PWD='root'
DB_NAME='ny_taxi'

engine=create_engine(f'postgresql://{USER}:{PWD}@{HOST}:{PORT}/{DB_NAME}')

In [5]:
# check 'rides' schema
print(pd.io.sql.get_schema(rides, name='rides', con=engine))

CREATE TABLE rides (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type BIGINT,
	congestion_surcharge FLOAT(53)
)

In [32]:
# add 'rides' table to database in batches
rides = pd.read_csv(
    Path('green_tripdata_2019-01.csv'), 
    parse_dates=['lpep_pickup_datetime', 'lpep_dropoff_datetime']
)

In [36]:
%time rides.to_sql(name='rides', con=engine, index=False, if_exists='append', chunksize=10000)

CPU times: user 53.8 s, sys: 1.44 s, total: 55.2 s
Wall time: 1min 54s

63918

In [37]:
# add 'zones' to database
%time zones.to_sql(name='zones', con=engine, index=False, if_exists='append', chunksize=10000)

CPU times: user 11.2 ms, sys: 3.67 ms, total: 14.9 ms
Wall time: 67.3 ms

265

In [14]:
# get db connection
db_connection=engine.connect()

In [23]:
# hw question 3
from sqlalchemy import text

query="""
SELECT COUNT(*) FROM rides 
WHERE lpep_pickup_datetime>='2019-01-15 00:00:00' 
    AND lpep_dropoff_datetime<'2019-01-16 00:00:00'
"""

display(pd.read_sql(text(query), con=db_connection))

   count
0  20530

In [24]:
# hw question 4
query="""
SELECT SUM(trip_distance) AS total_dist, DATE_TRUNC('DAY', lpep_dropoff_datetime) AS day FROM rides 
GROUP BY day ORDER BY total_dist DESC
"""

display(pd.read_sql(text(query), con=db_connection))

    total_dist        day
0     83375.69 2019-01-25
1     80249.97 2019-01-17
2     79445.14 2019-01-11
3     79276.84 2019-01-10
4     78082.96 2019-01-16
5     76760.91 2019-01-23
6     76588.62 2019-01-09
7     76129.34 2019-01-18
8     75667.17 2019-01-24
9     74890.77 2019-01-26
10    74802.86 2019-01-15
11    74691.44 2019-01-04
12    74637.12 2019-01-29
13    74023.88 2019-01-28
14    72967.18 2019-01-03
15    71337.72 2019-01-22
16    71274.60 2019-01-30
17    71174.96 2019-01-08
18    70363.66 2019-01-31
19    70276.64 2019-01-07
20    69957.61 2019-01-14
21    67829.21 2019-01-12
22    66395.78 2019-01-02
23    64090.69 2019-01-27
24    63807.32 2019-01-05
25    63693.16 2019-01-19
26    62085.68 2019-01-06
27    60125.70 2019-01-13
28    53862.05 2019-01-01
29    47445.00 2019-01-20
30    43439.87 2019-01-21
31      787.64 2019-02-01
32       44.99 2018-12-31
33       42.45 2009-01-01
34       24.05 2010-09-23
35        1.40 2010-09-24
36        0.00 2018-12-06
37        0.00 2018-12-21
38        0.00 2009-01-02
39        0.00 2018-12-07
40        0.00 2018-12-04
41        0.00 2018-12-08
42        0.00 2018-12-05

In [25]:
# hw question 5
query="""
select COUNT(1), passenger_count FROM rides
WHERE DATE_TRUNC('DAY', lpep_pickup_datetime)='2019-01-01'
GROUP BY passenger_count
"""

display(pd.read_sql(text(query), con=db_connection))

   count  passenger_count
0     21                0
1  12415                1
2   1282                2
3    254                3
4    129                4
5    616                5
6    273                6

In [28]:
# hw question 6
query="""
SELECT * FROM (
    SELECT tip_amount, zpu."Zone" AS pickup_zone, zdo."Zone" AS drop_zone FROM rides t 
    JOIN zones zpu ON t."PULocationID" = zpu."LocationID" 
    JOIN zones zdo ON t."DOLocationID" = zdo."LocationID"
    ) as rides_zones 
WHERE pickup_zone = 'Astoria' 
ORDER BY tip_amount DESC
LIMIT 1
"""

display(pd.read_sql(text(query), con=db_connection))

   tip_amount pickup_zone                      drop_zone
0        88.0     Astoria  Long Island City/Queens Plaza